#### Terraform Plan (Dev) 📋

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-research-bandits-dev"
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "research-bandits"
        }
    }

  # module.app_service_plan.azurerm_service_plan.main will be created
  + resource "azurerm_service_plan" "main" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "westeurope"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "asp-research-bandits-dev"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "rg-research-bandits-dev"
      + sku_name                        = "F1"
      + tags                            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "research-bandits"
        }
      + worker_count                    = (known after apply)
    }

  # module.app_service_plan.azurerm_user_assigned_identity.app_service will be created
  + resource "azurerm_user_assigned_identity" "app_service" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "asp-research-bandits-dev-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-research-bandits-dev"
      + tags                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "research-bandits"
        }
      + tenant_id           = (known after apply)
    }

  # module.container_apps_environment.azurerm_container_app_environment.main will be created
  + resource "azurerm_container_app_environment" "main" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westeurope"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "cae-research-bandits-dev"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-research-bandits-dev"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "research-bandits"
        }
      + zone_redundancy_enabled          = false
    }

  # module.container_apps_environment.azurerm_user_assigned_identity.container_apps will be created
  + resource "azurerm_user_assigned_identity" "container_apps" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "cae-research-bandits-dev-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-research-bandits-dev"
      + tags                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "research-bandits"
        }
      + tenant_id           = (known after apply)
    }

  # module.container_registry.azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + data_endpoint_host_names      = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "acrresearchbanditsdev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-research-bandits-dev"
      + sku                           = "Basic"
      + tags                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "research-bandits"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # module.container_registry.azurerm_role_assignment.acr_pull_app_service will be created
  + resource "azurerm_role_assignment" "acr_pull_app_service" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.container_registry.azurerm_role_assignment.acr_pull_container_apps will be created
  + resource "azurerm_role_assignment" "acr_pull_container_apps" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.container_registry.azurerm_role_assignment.acr_push_service_principal[0] will be created
  + resource "azurerm_role_assignment" "acr_push_service_principal" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPush"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # module.log_analytics.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = "westeurope"
      + name                            = "law-research-bandits-dev"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-research-bandits-dev"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "research-bandits"
        }
      + workspace_id                    = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_login_server                = (known after apply)
  + acr_name                        = "acrresearchbanditsdev"
  + app_service_identity_id         = (known after apply)
  + app_service_plan_id             = (known after apply)
  + app_service_plan_name           = "asp-research-bandits-dev"
  + container_apps_default_domain   = (known after apply)
  + container_apps_environment_id   = (known after apply)
  + container_apps_environment_name = "cae-research-bandits-dev"
  + container_apps_identity_id      = (known after apply)
  + container_apps_static_ip        = (known after apply)
  + log_analytics_workspace_id      = (known after apply)
  + log_analytics_workspace_name    = "law-research-bandits-dev"
  + resource_group_name             = "rg-research-bandits-dev"

```

</details>

*Pusher: @ramonVDAKKER, Action: `pull_request`*